02_PRFG3/base_case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         67.00;

deltaT          8e-4;

writeControl    timeStep;

writeInterval   1250;

purgeWrite      2;

writeFormat     ascii;

writePrecision  7;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

libs
(
     "./synInflowLib.so"
);

functions
{
    #includeFunc  probes0 
    #includeFunc  probes1 
	#includeFunc  probes2 
	#includeFunc  probes3 
	#includeFunc  probes4 
	#includeFunc  probes5 
	#includeFunc  probes6 
	#includeFunc  probes7
	#includeFunc  probes0H
    #includeFunc  probes1H 
	#includeFunc  probes2H 
	#includeFunc  probes3H 
	#includeFunc  probes4H 
	#includeFunc  probes5H 
	#includeFunc  probes6H 
	#includeFunc  probes7H
	
div1
    {
        type            div;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
        field           U;
	timeStart       14; 
    }

yPlus1
{
type	yPlus;
libs	("libfieldFunctionObjects.so");
writeControl	writeTime;
timeStart	14;
}




fieldAverage1
   {
      type            fieldAverage;
      libs            ("libfieldFunctionObjects.so");
      writeControl    writeTime;
      timeStart       14; //

      fields
         (
            U
            {
               mean        on;
               prime2Mean  on; //Reynoldstress Tensor
               base        time;
            }
            p
            {
               mean        on;
               prime2Mean  on; // variance
               base        time;
            }

		div(U)
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
         );
   }

	
}

// ************************************************************************* //
