02_PRFG3/base_case/system/probes3H
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

type            probes;
libs            ("libsampling.so");
writeControl    timeStep;
writeInterval   1;

fields
(
    U
);

probeLocations
(
(3.75 1.5 0.45)
(3.75 1.45 0.45)
(3.75 1.4 0.45)
(3.75 1.35 0.45)
(3.75 1.3 0.45)
(3.75 1.25 0.45)
(3.75 1.2 0.45)
(3.75 1.15 0.45)
(3.75 1.1 0.45)
(3.75 1.05 0.45)
(3.75 1 0.45)
(3.75 0.95 0.45)
(3.75 0.9 0.45)
(3.75 0.85 0.45)
(3.75 0.8 0.45)
(3.75 0.75 0.45)
(3.75 0.7 0.45)
(3.75 0.65 0.45)
(3.75 0.6 0.45)
(3.75 0.55 0.45)
(3.75 0.5 0.45)
(3.75 0.45 0.45)
(3.75 0.4 0.45)
(3.75 0.35 0.45)
(3.75 0.3 0.45)
(3.75 0.25 0.45)
(3.75 0.2 0.45)
(3.75 0.15 0.45)
(3.75 0.1 0.45)
(3.75 0.05 0.45)
(3.75 0 0.45)


);

// ************************************************************************* //
