02_PRFG3/base_case/system/probes4
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

type            probes;
libs            ("libsampling.so");
writeControl    timeStep;
writeInterval   1;

fields
(
    U
);

probeLocations
(
(5 0.15 0.45)
(5 0 0.45)
(5 -0.15 0.45)
(5 0 0.43)
(5 0 0.35)
(5 0 0.01)
(5 0 0.02)
(5 0 0.03)
(5 0 0.04)
(5 0 0.05)
(5 0 0.06)
(5 0 0.07)
(5 0 0.08)
(5 0 0.09)
(5 0 0.1)
(5 0 0.12)
(5 0 0.14)
(5 0 0.16)
(5 0 0.18)
(5 0 0.2)
(5 0 0.22)
(5 0 0.24)
(5 0 0.26)
(5 0 0.28)
(5 0 0.3)
(5 0 0.32)
(5 0 0.36)
(5 0 0.4)
(5 0 0.45)
(5 0 0.5)
(5 0 0.55)
(5 0 0.6)
(5 0 0.65)
(5 0 0.7)
(5 0 0.75)
(5 0 0.8)
(5 0 0.85)
(5 0 0.9)
(5 0 0.95)
(5 0 1)
(5 0 1.05)
(5 0 1.1)
(5 0 1.15)
(5 0 1.2)
(5 0 1.25)
(5 0 1.3)
(5 0 1.4)
(5 0 1.5)
(5 0 1.6)
(5 0 1.7)
(5 0 1.8)
(5 0 1.9)
(5 0 2.05)
(5 0 2.2)
(5 0 2.35)
(5 0 2.5)


);

// ************************************************************************* //
